Nukersson/platform-ststm32/misc/svd/STM32H7x5.svd
        <register>
          <name>GPIOA_PUPDR</name>
          <displayName>GPIOA_PUPDR</displayName>
          <description>GPIO port pull-up/pull-down
          register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x12100000</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD1</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD2</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD3</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD4</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD5</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD6</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD7</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD8</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD9</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD10</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD11</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD12</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD13</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD14</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PUPD15</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O pull-up or pull-down</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_IDR</name>
          <displayName>GPIOA_IDR</displayName>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID1</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID2</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID3</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID4</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID5</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID6</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID7</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID8</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID9</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID10</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID11</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID12</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID13</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID14</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ID15</name>
              <description>Port input data bit (y = 0..15) These
              bits are read-only. They contain the input value of
              the corresponding I/O port.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOA_ODR</name>
          <displayName>GPIOA_ODR</displayName>
          <description>GPIO port output data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OD0</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD1</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD2</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD3</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD4</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD5</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD6</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD7</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD8</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD9</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD10</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD11</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD12</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD13</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD14</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OD15</name>
              <description>Port output data bit These bits can be
              read and written by software. Note: For atomic bit
              set/reset, the OD bits can be individually set and/or
              reset by writing to the GPIOx_BSRR or GPIOx_BRR
              registers (x = A..F).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
